-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Apr 15, 2022 at 05:44 PM
-- Server version: 8.0.21
-- PHP Version: 7.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `answers`
--

DROP TABLE IF EXISTS `answers`;
CREATE TABLE IF NOT EXISTS `answers` (
  `id` int NOT NULL AUTO_INCREMENT,
  `poll_id` int NOT NULL,
  `title` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `answers`
--

INSERT INTO `answers` (`id`, `poll_id`, `title`) VALUES
(1, 1, '2'),
(2, 1, '1'),
(3, 1, '2'),
(4, 1, '2');

-- --------------------------------------------------------

--
-- Table structure for table `poll_answers`
--

DROP TABLE IF EXISTS `poll_answers`;
CREATE TABLE IF NOT EXISTS `poll_answers` (
  `id` int NOT NULL AUTO_INCREMENT,
  `poll_id` int NOT NULL,
  `horizontal_id` int NOT NULL,
  `vertical_id` int NOT NULL,
  `title` text NOT NULL,
  `title1` varchar(40) NOT NULL,
  `votes` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=201 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `poll_answers`
--

INSERT INTO `poll_answers` (`id`, `poll_id`, `horizontal_id`, `vertical_id`, `title`, `title1`, `votes`) VALUES
(1, 1, 1, 1, 'монтёр', 'часовщик', 0),
(3, 2, 2, 1, 'Электрик', 'бухгалтер', 0),
(5, 3, 3, 1, 'Авиамеханик', 'Маркетолог', 0),
(7, 4, 4, 1, 'Автомеханик', 'Переводчик', 0),
(9, 5, 5, 1, 'Радиомеханик', 'Учитель', 0),
(11, 6, 6, 1, 'Водопроводчик', 'Специалист по профориентации', 0),
(13, 7, 7, 1, 'Ювелир', 'Кассир', 0),
(15, 8, 8, 1, 'Кузнец', 'Машинист', 0),
(17, 9, 9, 1, 'Электромеханик', 'Лесник', 0),
(19, 10, 10, 1, 'Часовщик', 'Проектировщик', 0),
(21, 11, 1, 2, 'Кассир', 'Электромеханик', 0),
(23, 12, 2, 2, 'Бухгалтер', 'Работник банка', 0),
(25, 13, 3, 2, 'Работник банка', 'Продавец в книжном магазине', 0),
(27, 14, 4, 2, 'Бухгалтер', 'Редактор', 0),
(29, 15, 5, 2, 'Учитель математики', 'Врач', 0),
(31, 16, 6, 2, 'Преподаватель бухучета', 'Молдо/Священник', 0),
(33, 17, 7, 2, 'Математик', 'Политик', 0),
(35, 18, 8, 2, 'Работник банка', 'Специалист по логистике', 0),
(37, 19, 9, 2, 'Преподаватель бухучета', 'Плотник', 0),
(39, 20, 10, 2, 'Бухгалтер', 'Певец', 0),
(41, 21, 1, 3, 'Агент по торг.недвижимости', 'Механик радио/ТВ', 0),
(43, 22, 2, 3, 'Офисный работник', 'Математик', 0),
(45, 23, 3, 3, 'Милиционер', 'Маркетолог', 0),
(47, 24, 4, 3, 'Милиционер', 'Учитель русского языка', 0),
(49, 25, 5, 3, 'Чиновник', 'Адвокат', 0),
(51, 26, 6, 3, 'Торговец', 'Педагог группы продленного дня', 0),
(53, 27, 7, 3, 'Работник почты', 'Парикмахер', 0),
(55, 28, 8, 3, 'Торговля 1000 мелочей', 'Водитель автобуса', 0),
(57, 29, 9, 3, 'Продавец книжного магазина', 'Фермер', 0),
(59, 30, 10, 3, 'Кассир', 'Дизайнер рекламного агентства', 0),
(61, 31, 1, 4, 'Библиотекарь', 'Автомеханик', 0),
(63, 32, 2, 4, 'Журналист', 'Бухгалтер', 0),
(65, 33, 3, 4, 'Переводчик', 'Офисный работник', 0),
(67, 34, 4, 4, 'Писатель', 'Политик', 0),
(69, 35, 5, 4, 'Библиотекарь', 'Аптекарь', 0),
(71, 36, 6, 4, 'Политик', 'Специалист по социальной помощи', 0),
(73, 37, 7, 4, 'Учитель языка', 'Портье в гостинице', 0),
(75, 38, 8, 4, 'Учитель русского языка', 'Таксист', 0),
(77, 39, 9, 4, 'Редактор', 'Эколог', 0),
(79, 40, 10, 4, 'Переводчик', 'Химик', 0),
(81, 41, 1, 5, 'Учитель', 'Электрик', 0),
(83, 42, 2, 5, 'Инженер', 'Финансист', 0),
(85, 43, 3, 5, 'Зубной врач', 'Агент по торг.недвижимости', 0),
(87, 44, 4, 5, 'Судья', 'Библиотекарь', 0),
(89, 45, 5, 5, 'Архитектор', 'Ветеринар', 0),
(91, 46, 6, 5, 'Аптекарь', 'Медсестра', 0),
(93, 47, 7, 5, 'Врач', 'Уличная торговля', 0),
(95, 48, 8, 5, 'Ветеринар', 'Пилот', 0),
(97, 49, 9, 5, 'Ученый', 'Садовник', 0),
(99, 50, 10, 5, 'Адвокат', 'Живописец', 0),
(101, 51, 1, 6, 'Врач', 'Ювелир', 0),
(103, 52, 2, 6, 'Медсестра', 'Кассир', 0),
(105, 53, 3, 6, 'Специалист по социальной помощи', 'Продавец', 0),
(107, 54, 4, 6, 'Молдо/Священник', 'Журналист', 0),
(109, 55, 5, 6, 'Помощь по дому пожилым', 'Инженер', 0),
(111, 56, 6, 6, 'Воспитательница', 'Врач', 0),
(113, 57, 7, 6, 'Медсестра', 'Продавец', 0),
(115, 58, 8, 6, 'Специалист в центре занятости', 'Водитель скорой помощи', 0),
(117, 59, 9, 6, 'Специалист по профориентации', 'Егерь', 0),
(119, 60, 10, 6, 'Работник детского сада', 'Музыкант', 0),
(121, 61, 1, 7, 'Кассир', 'Водопроводчик', 0),
(123, 62, 2, 7, 'Официант', 'Учитель математики', 0),
(125, 63, 3, 7, 'Кассир', 'Секретарь', 0),
(127, 64, 4, 7, 'Гид/Экскурсовод', 'Писатель', 0),
(129, 65, 5, 7, 'Портье в гостинице', 'Ученый', 0),
(131, 66, 6, 7, 'Торговый агент', 'Помощь по дому пожилым', 0),
(133, 67, 7, 7, 'Сотрудник молодежного клуба', 'Экскурсовод', 0),
(135, 68, 8, 7, 'Помощь по дому пожилым', 'Почтальон', 0),
(137, 69, 9, 7, 'Работник турагентства', 'Огородник', 0),
(139, 70, 10, 7, 'Парикмахер', 'Архитектор', 0),
(141, 71, 1, 8, 'Таксист', 'Ювелир', 0),
(143, 72, 2, 8, 'Капитан корабля', 'Бухгалтер', 0),
(145, 73, 3, 8, 'Почтальон', 'Чиновник', 0),
(147, 74, 4, 8, 'Дальнобойщик', 'Учитель русского языка', 0),
(149, 75, 5, 8, 'Пилот', 'Судья', 0),
(151, 76, 6, 8, 'Гид/экскурсовод', 'Медсестра', 0),
(153, 77, 7, 8, 'Специалист по логистике', 'Работник турагентства', 0),
(155, 78, 8, 8, 'Водитель автобуса', 'Капитан судна', 0),
(157, 79, 9, 8, 'Штурман(направляющий)', 'Трубочист', 0),
(159, 80, 10, 8, 'Водитель скорой помощи', 'Программист', 0),
(161, 81, 1, 9, 'Фермер', 'Автомеханик', 0),
(163, 82, 2, 9, 'Каменщик/кладчик', 'Работник банка', 0),
(165, 83, 3, 9, 'Рыбак', 'Милиционер', 0),
(167, 84, 4, 9, 'Егерь', 'Продавец книжного магазина', 0),
(169, 85, 5, 9, 'Садовод', 'Архитектор', 0),
(171, 86, 6, 9, 'Строитель', 'Воспитательница', 0),
(173, 87, 7, 9, 'Плотник', 'Сотрудник молодежного клуба', 0),
(175, 88, 8, 9, 'Садовник', 'Гид/экскурсовод', 0),
(177, 89, 9, 9, 'Трубочист', 'Рыбак', 0),
(179, 90, 10, 9, 'Лесничий', 'Композитор', 0),
(181, 91, 1, 10, 'Музыкант', 'Инженер', 0),
(183, 92, 2, 10, 'Скульптор', 'Финансист', 0),
(185, 93, 3, 10, 'Музыкант', 'Специалист по кадрам', 0),
(187, 94, 4, 10, 'Живописец', 'Переводчик', 0),
(189, 95, 5, 10, 'Архитектор', 'Зубной врач', 0),
(191, 96, 6, 10, 'Химик', 'Медсестра', 0),
(193, 97, 7, 10, 'Дизайнер рекламного агентства', 'Помощь по дому пожилым', 0),
(195, 98, 8, 10, 'Актёр', 'Штурман', 0),
(197, 99, 9, 10, 'Поэт', 'Эколог', 0),
(199, 100, 10, 10, 'Певец', 'Графический дизайнер', 0);

-- --------------------------------------------------------

--
-- Table structure for table `profile1`
--

DROP TABLE IF EXISTS `profile1`;
CREATE TABLE IF NOT EXISTS `profile1` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `surename` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `profile1`
--

INSERT INTO `profile1` (`id`, `name`, `surename`) VALUES
(71, 'Nurlan', 'Musa'),
(74, 'nurlan1', 'musa1'),
(75, 'cdmaaan', 'cdmaaan'),
(76, 'sd', 'sd'),
(77, 'Hola', 'Hola'),
(78, 'yhjhj', 'ghj'),
(79, 'yhjhj', 'ghj'),
(80, 'nurlan', 'musaev'),
(81, 'nurlan', 'musa'),
(82, 'd', 'd');

-- --------------------------------------------------------

--
-- Table structure for table `results`
--

DROP TABLE IF EXISTS `results`;
CREATE TABLE IF NOT EXISTS `results` (
  `id` int NOT NULL AUTO_INCREMENT,
  `vertical_id` int NOT NULL,
  `tel_no` int NOT NULL,
  `hor_id_1` int NOT NULL,
  `hor_id_2` int NOT NULL,
  `hor_id_3` int NOT NULL,
  `hor_id_4` int NOT NULL,
  `hor_id_5` int NOT NULL,
  `hor_id_6` int NOT NULL,
  `hor_id_7` int NOT NULL,
  `hor_id_8` int NOT NULL,
  `hor_id_9` int NOT NULL,
  `hor_id_10` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
